In [8]:
import pandas as pd
import pymysql

In [9]:
conn=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [10]:
cur=conn.cursor()

In [11]:
sql_1="SELECT * FROM usertbl;"
sql_2="SELECT * FROM buytbl;"

In [12]:
cur.execute(sql_1)
rows=cur.fetchall()
conn.close()

In [13]:
pd=pd.DataFrame(rows)
pd.head()

     0    1     2   3    4        5    6           7
0  BBK  바비킴  1973  서울  010  0000000  176  2013-05-05
1  EJW  은지원  1972  경북  011  8888888  174  2014-03-03
2  JKW  조관우  1965  경기  018  9999999  172  2010-10-10
3  JYP  조용필  1950  경기  011  4444444  166  2009-04-04
4  KBS  김범수  1979  경남  011  2222222  173  2012-04-04

In [14]:
import pandas as pd
import pymysql

In [15]:
conn=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [16]:
cur=conn.cursor()

In [17]:
cur.execute(sql_2)
rows_1=cur.fetchall()
conn.close()

In [18]:
pd=pd.DataFrame(rows_1)
pd.head()

   0    1    2     3     4  5
0  2  KBS  운동화  None    30  2
1  3  KBS  노트북    전자  1000  1
2  4  JYP  모니터    전자   200  1
3  5  BBK  모니터    전자   200  5
4  6  KBS  청바지    의류    50  3